n5/src/InformationRegisters/TimesheetResolutions/TimesheetResolutions.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>TimesheetResolutions</name>
  <resources>
    <name>Memo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>TimesheetApproval</name>
    <type>
      <types>BusinessProcessRef.TimesheetApproval</types>
    </type>
  </dimensions>
  <dimensions>
    <name>User</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Date</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

n5/src/InformationRegisters/TimesheetResolutions/Forms/NewMemo/Module.bsl
// *****************************************
// *********** Form events

&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )
	
	setTimesheetsResolutionsParams ();
	
EndProcedure

&AtServer
Procedure setTimesheetsResolutionsParams ()
	
	Resolutions.Parameters.SetParameterValue ( "TimesheetApproval", Record.TimesheetApproval );
	
EndProcedure 

&AtServer
Procedure BeforeWriteAtServer ( Cancel, CurrentObject, WriteParameters )
	
	CurrentObject.User = SessionParameters.User;
	CurrentObject.Date = CurrentSessionDate ();
	
EndProcedure

// *****************************************
// *********** Group

&AtClient
Procedure WriteAndClose ( Command )
	
	if ( Write () ) then
		Close ( Record.Memo );
	endif; 
	
EndProcedure
